Revit 2024 API
ElectricalSystem.SelectPanel Method
 Set the panel for the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void SelectPanel(
	FamilyInstance panel
)
Visual Basic
Public Sub SelectPanel ( _
	panel As FamilyInstance _
)
Visual C++
public:
void SelectPanel(
	FamilyInstance^ panel
)
Parameters
panel
Type: Autodesk.Revit.DB.FamilyInstance
 The panel of the electrical system.
Remarks
 If successful, the panel will be set for the system. Otherwise the exception will be thrown. This method will only function with the Autodesk Revit MEP application.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  The panel does not have enough slots and Feed Through Lugs is unchecked or already in use. -or- Thrown when the panel cannot be set for the electrical system.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace